# Класс для парсинга работодателей: получает от пользователя имя компании и выводит данные
# (id, name, количество открытых вакансий) о работодателе в виде списка

# Класс для парсинга вакансий: получает из класса работодателя id компании и выводит данные о вакансиях

# Класс файл менеджер: сохраняет данные о работодателях и вакансиях полученных из классов парсинга в файл json

# Класс для создания базы данных: получает данные о работодателях и вакансиях и сохраняет их в таблицы

# Класс для работы с базой данных и таблицами

